src/main/resources/wsdl/insuranceV1.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!-- Licensed to the Apache Software Foundation (ASF) under one or more contributor 
	license agreements. See the NOTICE file distributed with this work for additional 
	information regarding copyright ownership. The ASF licenses this file to 
	You under the Apache License, Version 2.0 (the "License"); you may not use 
	this file except in compliance with the License. You may obtain a copy of 
	the License at http://www.apache.org/licenses/LICENSE-2.0 Unless required 
	by applicable law or agreed to in writing, software distributed under the 
	License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS 
	OF ANY KIND, either express or implied. See the License for the specific 
	language governing permissions and limitations under the License. -->

<wsdl:definitions name="insuranceV10.wsdl"
	targetNamespace="http://bpel.innoq.com/insurance/v1" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
	xmlns:tns="http://bpel.innoq.com/insurance/v1" xmlns:xs="http://www.w3.org/2001/XMLSchema"
	xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://bpel.innoq.com/order/v1" xmlns:v1types="http://bpel.innoq.com/insurance/v1/types">


	<!-- Type definitions for input- and output parameters for webservice -->
	<wsdl:types>
		<xs:schema targetNamespace="http://bpel.innoq.com/insurance/v1">
			<xs:import
				namespace="http://bpel.innoq.com/insurance/v1/types"
				schemaLocation="insuranceV1types.xsd">
			</xs:import></xs:schema>
	</wsdl:types>
	<!-- Message definitions for input and output -->
	<wsdl:message name="CarInsuranceFindProcess">
		<wsdl:part name="parameters" element="v1types:CarInsuranceFindProcess" />
	</wsdl:message>
	<wsdl:message name="processInvokeResult">
		<wsdl:part name="resultCode" element="v1types:processConfirmation" />
	</wsdl:message>

	<!-- Port (interface) definitions -->
	<wsdl:portType name="InsuranceProcessEndpoint">
		<wsdl:operation name="order">
			<wsdl:input message="tns:CarInsuranceFindProcess" />
			<wsdl:output message="tns:processInvokeResult" />
		</wsdl:operation>
	</wsdl:portType>


	<!-- Port bindings to transports and encoding - HTTP, document literal encoding 
		is used -->
	<wsdl:binding name="InsuranceBinding" type="tns:InsuranceProcessEndpoint">
		<soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
		<wsdl:operation name="order">
			<soap:operation soapAction="http://bpel.innoq.com/CarInsurance"
				style="document" />
			<wsdl:input>
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>

	<!-- Service definition -->
	<wsdl:service name="InsuranceEndpointService">
		<wsdl:port name="InsuranceService" binding="tns:InsuranceBinding">
			<soap:address location="http://localhost/order" />
		</wsdl:port>
	</wsdl:service>

</wsdl:definitions>
